# GetValues Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..GetValues Method
ExportPatternTable Class See Also
---
Returns all the values stored in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ExportPatternInfo> GetValues()
```

Visual Basic
---
```text
Public Function GetValues As IList(Of ExportPatternInfo)
```

Visual C++
---
```text
public:
IList<ExportPatternInfo^>^ GetValues()
```

# ### Return Value
Return the info array.
# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace